# Member2D

Representation of member2D

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.member2_d import Member2D

# TODO update the JSON string below
json = "{}"
# create an instance of Member2D from a JSON string
member2_d_instance = Member2D.from_json(json)
# print the JSON string representation of the object
print(Member2D.to_json())

# convert the object into a dict
member2_d_dict = member2_d_instance.to_dict()
# create an instance of Member2D from a dict
member2_d_from_dict = Member2D.from_dict(member2_d_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)